app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
  def index
    @recipes = Recipe.all

INSERT INTO "recipes" ("title", "author", "ingredients", "instructions", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "myTag"], ["created_at", "2015-10-27 18:57:04.650913"], ["updated_at", "2015-10-27 18:57:04.650913"]]
---
  def add_tag
    @recipe = Recipe.find(params[:id])
    # Check to see if the tag's name exists yet, and if so, use that tag id
    tag_name_string_from_user = params[:tag][:name]
    @tag = Tag.find_or_create_by(name: tag_name_string_from_user)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_recipe
      @recipe = Recipe.find(params[:id])